/**
 * SPOILERS
 *
 * This file contains the list of answers for the game. It's not recommended to continue reading this file.
 *
 * 剧透警告
 *
 * 该文件包含了游戏的答案列表。不建议继续阅读。
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */

import {seedShuffle} from './utils'

function prepare<T>(len: number, arr: T[]) {
  if (import.meta.hot && arr.length !== len)
    throw new Error(`expect array length ${arr.length} to be ${len}`)
  return arr
}

export const _PRE = prepare(1, [[]])

export const _2024_MAR = prepare(31, seedShuffle([
  ['风调雨顺', '风'],
  ['指鹿为马', '鹿'],
  ['不分轩轾', '不'],
  ['无微不至', '至'],
  ['对症下药', '症'],
  ['一字千金', '一'],
  ['夙夜匪懈', '夙'],
  ['寡不敌众', '寡'],
  ['层出不穷', '穷'],
  ['失魂落魄', '魄'],
  ['胜券在握', '券'],
  ['分道扬镳', '分'],
  ['三令五申', '申'],
  ['晶莹剔透', '莹'],
  ['几可乱真', '几'],
  ['危如累卵', '如'],
  ['望梅止渴', '望'],
  ['无所适从', '所'],
  ['闲适自得', '闲'],
  ['惊心动魄', '心'],
  ['寥寥可数', '寥'],
  ['里应外合', '合'],
  ['洛阳纸贵', '洛'],
  ['造福桑梓', '造'],
  ['天花乱坠', '坠'],
  ['运筹帷幄', '运'],
  ['举一反三', '反'],
  ['临风顾盼', '盼'],
  ['和衷共济', '衷'],
  ['刚烈并济', '刚'],
  ['游手好闲', '好']]
, '2024_03'))

export const _2024_APR = prepare(30, seedShuffle([
  ['困兽之斗', '困'],
  ['无心插柳', '无'],
  ['负隅顽抗', '顽'],
  ['继往开来', '开'],
  ['怨天尤人', '人'],
  ['梦寐以求', '梦'],
  ['囤积居奇', '囤'],
  ['黛绿年华', '黛'],
  ['醉生梦死', '醉'],
  ['户限为穿', '穿'],
  ['四面楚歌', '四'],
  ['四面八方', '方'],
  ['孟母三迁', '母'],
  ['不足挂齿', '不'],
  ['卑躬屈膝', '屈'],
  ['日积月累', '月'],
  ['一鸣惊人', '惊'],
  ['随遇而安', '而'],
  ['飞黄腾达', '黄'],
  ['与世无争', '无'],
  ['白云苍狗', '云'],
  ['力挽狂澜', '澜'],
  ['土崩瓦解', '崩'],
  ['梅开二度', '开'],
  ['百川归海', '海'],
  ['金科玉律', '律'],
  ['先入为主', '先'],
  ['不苟言笑', '笑'],
  ['望其项背', '背'],
  ['背水一战', '水']]
, '2024_04'))

export const _2024_MAY = prepare(31, seedShuffle([
  ['否极泰来', '否'],
  ['平地风波', '波'],
  ['一毛不拔', '不'],
  ['咫尺天涯', '尺'],
  ['胼手胝足', '足'],
  ['市井小民', '小'],
  ['与众不同', '不'],
  ['梦笔生花', '花'],
  ['天马行空', '天'],
  ['不知所措', '知'],
  ['因人而异', '因'],
  ['一诺千金', '诺'],
  ['不可或缺', '或'],
  ['仗势欺人', '仗'],
  ['害群之马', '马'],
  ['不可思议', '不'],
  ['杯弓蛇影', '弓'],
  ['对牛弹琴', '牛'],
  ['回头是岸', '岸'],
  ['居安思危', '危'],
  ['庄周梦蝶', '周'],
  ['轻声细语', '轻'],
  ['缘木求鱼', '缘'],
  ['恃强凌弱', '凌'],
  ['家喻户晓', '户'],
  ['脱缰野马', '野'],
  ['力透纸背', '纸'],
  ['口蜜腹剑', '口'],
  ['拾金不昧', '昧'],
  ['海底捞针', '海'],
  ['乐极生悲', '极']]
, '2024_05'))

export const _2024_JUN = prepare(30, seedShuffle([
  ['不求甚解', '不'],
  ['置若罔闻', '若'],
  ['寿比南山', '南'],
  ['情同手足', '足'],
  ['山穷水尽', '水'],
  ['三顾茅庐', '顾'],
  ['一丘之貉', '之'],
  ['各有千秋', '有'],
  ['聚沙成塔', '成'],
  ['南柯一梦', '梦'],
  ['天经地义', '地'],
  ['好逸恶劳', '劳'],
  ['焦头烂额', '头'],
  ['贻笑大方', '贻'],
  ['滔滔不绝', '绝'],
  ['养家糊口', '养'],
  ['沉鱼落雁', '落'],
  ['战战兢兢', '战'],
  ['废寝忘食', '寝'],
  ['生不逢时', '生'],
  ['肝肠寸断', '断'],
  ['老马识途', '识'],
  ['鸠占鹊巢', '巢'],
  ['吹毛求疵', '吹'],
  ['孑然一身', '孑'],
  ['好事多磨', '磨'],
  ['满目疮痍', '疮'],
  ['能言善道', '道'],
  ['岌岌可危', '危'],
  ['心诚则灵', '则']]
, '2024_06'))

export const _2024_JUL = prepare(31, seedShuffle([
  ['流离失所', '离'],
  ['出人意表', '表'],
  ['政通人和', '政'],
  ['安步当车', '步'],
  ['翻山越岭', '岭'],
  ['小家碧玉', '小'],
  ['画蛇添足', '蛇'],
  ['过犹不及', '过'],
  ['浑浑噩噩', '噩'],
  ['八仙过海', '八'],
  ['咬文嚼字', '嚼'],
  ['努力不懈', '不'],
  ['冰天雪地', '天'],
  ['金石为开', '金'],
  ['毛遂自荐', '自'],
  ['脚踏实地', '脚'],
  ['谦冲为怀', '怀'],
  ['噤若寒蝉', '寒'],
  ['大公无私', '无'],
  ['威武不屈', '武'],
  ['抛砖引玉', '引'],
  ['尸位素餐', '素'],
  ['刚正不阿', '阿'],
  ['井然有序', '序'],
  ['完璧归赵', '赵'],
  ['海誓山盟', '海'],
  ['暗渡陈仓', '渡'],
  ['垂言三尺', '三'],
  ['呶呶不休', '不'],
  ['将计就计', '计'],
  ['杞人忧天', '人']]
, '2024_07'))

export const _2024_AUG = prepare(31, seedShuffle([
  ['波光粼粼', '光'],
  ['旁若无人', '若'],
  ['急公好利', '利'],
  ['国色天香', '色'],
  ['得意忘形', '意'],
  ['众望所归', '所'],
  ['义正词严', '正'],
  ['洗耳恭听', '听'],
  ['座无虚席', '虚'],
  ['羽扇纶巾', '纶'],
  ['人之常情', '情'],
  ['推波助澜', '助'],
  ['洋洋自得', '得'],
  ['四海升平', '四'],
  ['海市蜃楼', '海'],
  ['活灵活现', '活'],
  ['沧海遗珠', '遗'],
  ['营私舞弊', '弊'],
  ['沧海一粟', '海'],
  ['无远弗届', '届'],
  ['参差不齐', '齐'],
  ['增广见闻', '见'],
  ['不伦不类', '类'],
  ['英姿焕发', '发'],
  ['突如其来', '其'],
  ['心狠手辣', '手'],
  ['经济拮据', '据'],
  ['热泪盈眶', '盈'],
  ['熙来攘往', '往'],
  ['如雷贯耳', '贯'],
  ['焚膏继晷', '晷']]
, '2024_08'))

export const _2024_SEP = prepare(30, seedShuffle([
  ['画虎类犬', '虎'],
  ['后生可畏', '畏'],
  ['攀权附贵', '贵'],
  ['朝思暮想', '朝'],
  ['兄弟阋墙', '阋'],
  ['喧宾夺主', '喧'],
  ['春寒料峭', '寒'],
  ['天罗地网', '地'],
  ['维妙维肖', '妙'],
  ['刚愎自用', '刚'],
  ['唯唯诺诺', '唯'],
  ['移山倒海', '山'],
  ['雍容华贵', '华'],
  ['不屈不挠', '不'],
  ['青眼有加', '有'],
  ['好高骛远', '骛'],
  ['渔翁得利', '翁'],
  ['井底之蛙', '之'],
  ['举案齐眉', '举'],
  ['事半功倍', '功'],
  ['家徒四壁', '壁'],
  ['栉风沐雨', '风'],
  ['满腹经纶', '经'],
  ['如虎添翼', '翼'],
  ['鱼游沸鼎', '沸'],
  ['壮志凌云', '凌'],
  ['赞不绝口', '绝'],
  ['河东狮吼', '东'],
  ['外强中干', '外'],
  ['寄人篱下', '篱']]
, '2024_09'))

export const _2024_OCT = prepare(31, seedShuffle([
  ['叹为观止', '叹'],
  ['亡羊补牢', '亡'],
  ['青云直上', '上'],
  ['目空一切', '目'],
  ['海枯石烂', '海'],
  ['骄矜自满', '满'],
  ['草船借箭', '草'],
  ['粗茶淡饭', '粗'],
  ['适可而止', '而'],
  ['草菅人命', '命'],
  ['近乡情怯', '怯'],
  ['忐忑不安', '忑'],
  ['倚老卖老', '卖'],
  ['鹬蚌相争', '争'],
  ['泾渭分明', '分'],
  ['反求诸己', '诸'],
  ['不言而喻', '言'],
  ['巧夺天工', '工'],
  ['难分轩轾', '分'],
  ['屋下架屋', '架'],
  ['寻花问柳', '柳'],
  ['铤而走险', '铤'],
  ['剑拔弩张', '拔'],
  ['手头拮据', '据'],
  ['娓娓道来', '道'],
  ['阿谀奉承', '承'],
  ['案牍劳形', '案'],
  ['庸人自扰', '自'],
  ['班门弄斧', '斧'],
  ['拭目以待', '拭'],
  ['钜细靡遗', '细']]
, '2024_10'))

export const _2024_NOV = prepare(30, seedShuffle([
  ['至死不渝', '至'],
  ['栩栩如生', '栩'],
  ['宜室宜家', '家'],
  ['事倍功半', '事'],
  ['城下之盟', '城'],
  ['宵衣旰食', '宵'],
  ['大智若愚', '若'],
  ['刻舟求剑', '剑'],
  ['伺机而动', '机'],
  ['雪上加霜', '上'],
  ['闭月羞花', '花'],
  ['马耳东风', '马'],
  ['道不拾遗', '道'],
  ['温故知新', '新'],
  ['近悦远来', '远'],
  ['意气风发', '发'],
  ['原汁原味', '原'],
  ['大快朵颐', '快'],
  ['爱屋及乌', '屋'],
  ['呕心沥血', '沥'],
  ['才高八斗', '才'],
  ['一成不变', '成'],
  ['切肤之痛', '之'],
  ['居心叵测', '测'],
  ['寅吃卯粮', '寅'],
  ['百尺竿头', '尺'],
  ['吴下阿蒙', '吴'],
  ['如坐针毡', '针'],
  ['光阴似箭', '似'],
  ['孤芳自赏', '自']]
, '2024_11'))

export const _2024_DEC = prepare(31, seedShuffle([
  ['天衣无缝', '天'],
  ['用字遣词', '用'],
  ['喋喋不休', '不'],
  ['及时行乐', '时'],
  ['夜以继日', '以'],
  ['一笑置之', '一'],
  ['朝三暮四', '四'],
  ['南辕北辙', '北'],
  ['孜孜不倦', '孜'],
  ['天造地设', '天'],
  ['寻幽访胜', '胜'],
  ['风声鹤唳', '唳'],
  ['失之交臂', '失'],
  ['浮光掠影', '掠'],
  ['瘦骨嶙峋', '骨'],
  ['孤陋寡闻', '寡'],
  ['纯真无邪', '无'],
  ['如火如荼', '如'],
  ['大器晚成', '器'],
  ['探本穷源', '本'],
  ['趁火打劫', '劫'],
  ['抽丝剥茧', '剥'],
  ['寡廉鲜耻', '耻'],
  ['功亏一篑', '篑'],
  ['笨鸟先飞', '先'],
  ['离情依依', '依'],
  ['兼容并蓄', '蓄'],
  ['席不暇暖', '暇'],
  ['炊金馔玉', '金'],
  ['茅塞顿开', '顿'],
  ['天翻地覆', '地']]
, '2024_12'))

export const _2025_JAN = prepare(31, seedShuffle([
  ['伤天害理', '害'],
  ['满城风雨', '风'],
  ['侃侃而谈', '侃'],
  ['叱咤风云', '叱'],
  ['多难兴邦', '难'],
  ['心甘情愿', '情'],
  ['深思熟虑', '熟'],
  ['呆若木鸡', '鸡'],
  ['源源不绝', '不'],
  ['体无完肤', '完'],
  ['开诚布公', '诚'],
  ['巧取豪夺', '取'],
  ['当仁不让', '仁'],
  ['孤苦伶仃', '仃'],
  ['风中转蓬', '中'],
  ['恃才傲物', '傲'],
  ['沧海桑田', '沧'],
  ['罪大恶极', '罪'],
  ['不远千里', '千'],
  ['搦管弄翰', '搦'],
  ['杯水车薪', '水'],
  ['啼笑皆非', '啼'],
  ['集腋成裘', '集'],
  ['一蹶不起', '蹶'],
  ['振聋发聩', '发'],
  ['曲意逢迎', '曲'],
  ['高谈阔论', '论'],
  ['塞翁失马', '翁'],
  ['解民倒悬', '民'],
  ['屏气凝神', '气'],
  ['屈指可数', '屈']]
, '2025_01'))

export const _2025_FEB = prepare(28, seedShuffle([
  ['阉然媚世', '世'],
  ['咄咄逼人', '咄'],
  ['味美价廉', '廉'],
  ['另起炉灶', '灶'],
  ['不耻下问', '不'],
  ['豁然开朗', '豁'],
  ['学富五车', '学'],
  ['声东击西', '击'],
  ['珍馐名馔', '珍'],
  ['作恶多端', '恶'],
  ['敝帚自珍', '珍'],
  ['兴高采烈', '烈'],
  ['师心自用', '用'],
  ['后继无力', '力'],
  ['川流不息', '不'],
  ['沾沾自喜', '喜'],
  ['敬谢不敏', '敏'],
  ['笼中之鸟', '笼'],
  ['实事求是', '实'],
  ['如数家珍', '家'],
  ['奇货可居', '奇'],
  ['循循善诱', '循'],
  ['左顾右盼', '左'],
  ['贫贱不移', '贫'],
  ['天作之合', '之'],
  ['蚕食鲸吞', '吞'],
  ['扬汤止沸', '止'],
  ['步步为营', '步']]
, '2025_02'))

export const _2025_MAR = prepare(31, seedShuffle([
  ['红颜祸水', '红'],
  ['积少成多', '少'],
  ['夜郎自大', '大'],
  ['百折不挠', '挠'],
  ['坐立难安', '难'],
  ['执迷不悟', '迷'],
  ['孤掌难鸣', '孤'],
  ['衣冠禽兽', '衣'],
  ['才疏学浅', '学'],
  ['声名大噪', '名'],
  ['孤注一掷', '掷'],
  ['马首是瞻', '瞻'],
  ['众志成城', '众'],
  ['暗潮汹涌', '暗'],
  ['趋之若鹜', '趋'],
  ['威风凛凛', '威'],
  ['差强人意', '人'],
  ['立竿见影', '立'],
  ['啧啧称奇', '称'],
  ['先声夺人', '夺'],
  ['无为而治', '为'],
  ['狐假虎威', '威'],
  ['好大喜功', '功'],
  ['如影随形', '如'],
  ['趋炎附势', '炎'],
  ['兴致勃勃', '致'],
  ['不识之无', '不'],
  ['寡信轻诺', '信'],
  ['息息相关', '关'],
  ['反璞归真', '璞'],
  ['哀鸿遍野', '野']]
, '2025_03'))

export const _2025_APR = prepare(30, seedShuffle([
  ['捉襟见肘', '肘'],
  ['未雨绸缪', '绸'],
  ['怆然替下', '下'],
  ['因材施教', '教'],
  ['半斤八两', '半'],
  ['荷枪实弹', '荷'],
  ['以邻为壑', '以'],
  ['耳提面命', '面'],
  ['淋漓尽致', '尽'],
  ['寸草春晖', '晖'],
  ['因地制宜', '制'],
  ['不劳而获', '而'],
  ['守株待兔', '兔'],
  ['不智之举', '智'],
  ['一应具全', '具'],
  ['力竭声嘶', '声'],
  ['孺子可教', '教'],
  ['九牛一毛', '毛'],
  ['不胫而走', '而'],
  ['埋头苦干', '干'],
  ['大千世界', '大'],
  ['精诚所至', '所'],
  ['如丧考妣', '丧'],
  ['格格不入', '格'],
  ['难辞其咎', '咎'],
  ['嘘寒问暖', '寒'],
  ['约法三章', '法'],
  ['含饴弄孙', '孙'],
  ['得过且过', '得'],
  ['殊途同归', '同']]
, '2025_04'))

export const _2025_MAY = prepare(31, seedShuffle([
  ['乐善好施', '施'],
  ['巧言令色', '色'],
  ['跋山涉水', '跋'],
  ['百年树人', '百'],
  ['守口如瓶', '守'],
  ['千载难逢', '难'],
  ['踌躇满志', '满'],
  ['瓮中捉鳖', '鳖'],
  ['替天行道', '天'],
  ['车水马龙', '马'],
  ['越俎代庖', '越'],
  ['大言不惭', '惭'],
  ['如鱼得水', '鱼'],
  ['背道而驰', '道'],
  ['络绎不绝', '络'],
  ['鸟尽弓藏', '弓'],
  ['劳民伤财', '民'],
  ['绕梁三日', '日'],
  ['如胶似漆', '漆'],
  ['七步成诗', '步'],
  ['天诛地灭', '灭'],
  ['子虚乌有', '虚'],
  ['坐怀不乱', '怀'],
  ['鉴往知来', '鉴'],
  ['咎由自取', '自'],
  ['将信将疑', '将'],
  ['寸步不离', '不'],
  ['形销骨立', '立'],
  ['人微言轻', '人'],
  ['闻鸡起舞', '起'],
  ['困兽犹斗', '斗']]
, '2025_05'))

export const answers: string[][] = [
  ..._PRE,
  ..._2024_MAR,
  ..._2024_APR,
  ..._2024_MAY,
  ..._2024_JUN,
  ..._2024_JUL,
  ..._2024_AUG,
  ..._2024_SEP,
  ..._2024_OCT,
  ..._2024_NOV,
  ..._2024_DEC,
  ..._2025_JAN,
  ..._2025_FEB,
  ..._2025_MAR,
  ..._2025_APR,
  ..._2025_MAY,
]

// duplicated check
if (import.meta.hot) {
  const {checkValidIdiom} = await import('../logic')
  const map = new Map<string, number>()
  answers.forEach((a, i) => {
    if (!a[0])
      return
    if (!map.has(a[0]))
      map.set(a[0], i)
    else
      throw new Error(`Word ${a[0]} is duplicated at ${map.get(a[0])}`)
    if (a[1] && !a[0].includes(a[1]))
      throw new Error(`Hint ${a[1]} is not included in ${a[0]}`)
    if (!checkValidIdiom(a[0], true))
      throw new Error(`${a[0]} is not a valid idiom`)
  })
}
